WELCOME_TEXT= ('''
##########################################################################################
|                                                                                        |
|       ___    ___    _____    ___     __     _   _                                      |
|      / _/   |_ _|  |_   _|  / __|   /  \   | \ | |                                     |
|      \_ \    | |     | |   | (__   | () |  |  \  |                                     |
|      /__/   |___|   _|_|_   \___|  _\__/   |_\ \_|                                     |
|                                                                                        |
|       _   _      __      ___    _  _      __     _____    _   _     __     _   _       |
|      | |_| |    /  \    / __|  | |/ /    /  \   |_   _|  | |_| |   /  \   | \ | |      |
|      |  _  |   / /\ \  | (__   |  <(    / /\ \    | |    |  _  |  | () |  |  \  |      |
|      |_| |_|  /_/  \_\  \___|  |_|\_\  /_/  \_\  _|_|_   |_| |_|  _\__/   |_\ \_|      |
|                                                                                        |
|       ___      __     ___    _ _                                                       |
|      |_  )    /  \   |_  )  | | |                                                      |
|       / /    | () |   / /   |_  _|                                                     |
|      /___|   _\__/   /___|   _|_|_                                                     |
|                                                                                        |
|                                                                                        |
|########################################################################################|
''')

BOSS_TEXT1 = ('''
   你好我的朋友，恭喜你順利闖入第三關，相信你現在很著急想要救回你的同伴，但，這終局之戰豈能那麼容易讓你破關？
   接下來你將要面對的是世界上最為困難的遊戲
''')

NO = "\n竟然...好啦，至少你讓我獲得快樂，我這就給你最終解答吧，下次不會讓你贏的!!!!\n"

BOSS_TEXT2 = ('''
   嚇到了吧，哈哈，就知道你到這只是巧合，但你將要面臨的挑戰，將會讓你眼睜睜看著你同伴死去。
   當然你想拯救這一切也不是不可能，但你需要先取悅我，要如何取悅我？哼哼，打敗我你就算成功囉，只要你能順利猜到4A，那就算你獲勝，但有一些限制，你必須在７次內成功，否則，就沒機會啦。哈哈哈哈...
''')

HI = "n402o2n  hathkacvotcei sio l"


REDICU = ('''
   哈，終究還是怕了嗎，那就再會吧，我厲害的勇者 ლ(́◉◞౪◟◉ლ)
''')

SHA_ans = '5cddb60655c749694b65e11f06a8589e1badc04ca81f6a44ca5d116463aee8e7'

YES = "哈，太菜了，下次再來吧 ( ´∀`)\n"

ANS = "Who moved first is gay"
